---
kind: method
id: M:Autodesk.Revit.DB.AssemblyCodeTable.GetAssemblyCodeTable(Autodesk.Revit.DB.Document)
source: html/26b23f25-ef12-5368-3f4b-6097f93ce312.htm
---
# Autodesk.Revit.DB.AssemblyCodeTable.GetAssemblyCodeTable Method

Returns the AssemblyCodeTable for the specified document.

## Syntax (C#)
```csharp
public static AssemblyCodeTable GetAssemblyCodeTable(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`) - The document owns the AssemblyCodeTable.

## Returns
The AssemblyCodeTable for the document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null